import React, { useState, useEffect } from "react";
import Head from "next/head";
import { Box, Container, Unstable_Grid2 as Grid } from "@mui/material";
import { Layout as DashboardLayout } from "src/layouts/dashboard/layout";
import { OverviewBudget } from "src/sections/overview/overview-budget";
import TableChartByh from "src/components/tableChartByh";
import BarChartByh from "src/components/barChartByh";
import WardStatus from "src/components/wardStatus";
import dynamic from "next/dynamic";

// import Checkboxes from "./Components/mui/CheckBoxes";
// import BasicDatePicker from "src/components/basicDatePicker";


const BasicDatePicker = dynamic(import ("src/components/mui/basicDatePicker"), { ssr: false });
const Checkboxes = dynamic(import ("src/components/mui/checkBoxes"), { ssr: false });


 //로딩데이터(더미)
 const date = new Date();
 date.setMinutes(date.getMinutes() - 1);
 const year = date.getFullYear();
 const month = (date.getMonth() + 1).toString().padStart(2, "0");
 const day = date.getDate().toString().padStart(2, "0");
 const hours = date.getHours();
 const minutes = date.getMinutes();
 const seconds = date.getSeconds();

 const sampleData = [
   {
     data: [
       {
         구분: "간호간병",
         병동: "061W",
         전체가동율: "87.50%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "0.00%",
         "2인실A": "75.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "92.00%",
         기타: "-",
       },
       {
         구분: "간호간병",
         병동: "071W",
         전체가동율: "90.91%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "75.00%",
         "2인실A": "100.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "75.00%",
         "4인실B": "-",
         기준병실: "92.68%",
         기타: "-",
       },
       {
         구분: "간호간병",
         병동: "072W",
         전체가동율: "87.04%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "50.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "92.68%",
         기타: "-",
       },
       {
         구분: "간호간병",
         병동: "132W",
         전체가동율: "97.87%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "100.00%",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "97.50%",
         기타: "-",
       },
       {
         구분: "권역외상센터",
         병동: "T41W",
         전체가동율: "97.50%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "80.00%",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "100.00%",
         기타: "-",
       },
       {
         구분: "권역외상센터",
         병동: "T51W",
         전체가동율: "95.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "95.00%",
         기타: "-",
       },
       {
         구분: "권역외상센터",
         병동: "TICUA",
         전체가동율: "90.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "90.00%",
       },
       {
         구분: "권역외상센터",
         병동: "TICUB",
         전체가동율: "56.25%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "56.25%",
       },
       {
         구분: "권역외상센터",
         병동: "TICUC",
         전체가동율: "71.43%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "71.43%",
       },
       {
         구분: "권역응급의료센터",
         병동: "E41W",
         전체가동율: "90.24%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "50.00%",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "92.31%",
         기타: "-",
       },
       {
         구분: "권역응급의료센터",
         병동: "EICU",
         전체가동율: "70.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "70.00%",
       },
       {
         구분: "분만실",
         병동: "DLVR",
         전체가동율: "33.33%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "0.00%",
         "2인실A": "50.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "-",
       },
       {
         구분: "분만실",
         병동: "MFICU",
         전체가동율: "28.57%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "-",
       },
       {
         구분: "신생아",
         병동: "NBR",
         전체가동율: "-",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "-",
       },
       {
         구분: "완화병동",
         병동: "PCW",
         전체가동율: "81.82%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "83.33%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "75.00%",
         "4인실B": "-",
         기준병실: "-",
         기타: "-",
       },
       {
         구분: "이식병동",
         병동: "103W",
         전체가동율: "71.43%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "50.00%",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "70.00%",
         기타: "100.00%",
       },
       {
         구분: "일반병실",
         병동: "042W",
         전체가동율: "94.44%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "-",
         "2인실B": "75.00%",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "-",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "052W",
         전체가동율: "90.57%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "75.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "94.44%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "062W",
         전체가동율: "92.59%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "100.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "88.89%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "081W",
         전체가동율: "94.44%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "83.33%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "97.22%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "082W",
         전체가동율: "85.96%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "100.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "75.00%",
         "4인실B": "-",
         기준병실: "83.33%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "091W",
         전체가동율: "97.92%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "100.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "97.62%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "092W",
         전체가동율: "86.79%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "66.67%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "75.00%",
         "4인실B": "-",
         기준병실: "94.44%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "102W",
         전체가동율: "79.07%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "78.57%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "111W",
         전체가동율: "96.15%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "100.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "90.48%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "112W",
         전체가동율: "94.12%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "90.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "94.44%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "121W",
         전체가동율: "90.91%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "87.50%",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "91.67%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "122W",
         전체가동율: "96.36%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "100.00%",
         "2인실A": "92.86%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "100.00%",
         "4인실B": "-",
         기준병실: "97.22%",
         기타: "-",
       },
       {
         구분: "일반병실",
         병동: "131W",
         전체가동율: "73.91%",
         SVIP가동율: "0.00%",
         "특실 가동율": "87.50%",
         "1인실": "100.00%",
         "2인실A": "100.00%",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "75.00%",
         "4인실B": "-",
         기준병실: "-",
         기타: "-",
       },
       {
         구분: "폐쇄병동",
         병동: "101W",
         전체가동율: "95.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "100.00%",
         "3인실": "100.00%",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "91.67%",
         기타: "-",
       },
       {
         구분: "ICU",
         병동: "3CCU",
         전체가동율: "100.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "100.00%",
       },
       {
         구분: "ICU",
         병동: "5ICU",
         전체가동율: "93.75%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "93.75%",
       },
       {
         구분: "ICU",
         병동: "ICUA",
         전체가동율: "100.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "100.00%",
       },
       {
         구분: "ICU",
         병동: "ICUB",
         전체가동율: "63.64%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "63.64%",
       },
       {
         구분: "ICU",
         병동: "NCUA",
         전체가동율: "61.54%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "61.54%",
       },
       {
         구분: "ICU",
         병동: "NCUB",
         전체가동율: "66.67%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "66.67%",
       },
       {
         구분: "ICU",
         병동: "NICUA",
         전체가동율: "84.62%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "84.62%",
       },
       {
         구분: "ICU",
         병동: "NICUB",
         전체가동율: "90.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "90.00%",
       },
       {
         구분: "SUB-ICU",
         병동: "091S",
         전체가동율: "100.00%",
         SVIP가동율: "-",
         "특실 가동율": "-",
         "1인실": "-",
         "2인실A": "-",
         "2인실B": "-",
         "3인실": "-",
         "4인실A": "-",
         "4인실B": "-",
         기준병실: "-",
         기타: "100.00%",
       },
     ],
   },
 ];

 const categoryFilterData = [
   "간호간병",
   "권역외상센터",
   "권역응급의료센터",
   "분만실",
   "신생아",
   "완화병동",
 ];
 const wardFilterData = [
   "3CCU",
   "5ICU",
   "042W",
   "052W",
   "061W",
   "062W",
   "071W",
   "072W",
 ];



const Page = () => {

    const [category, setCategory] = useState([]);
    const [ward, setWard] = useState([]);
    // const [date, setDate] = useState("");
  
    useEffect(() => {
      console.log(`Filter(category) State has changed : ${category}`);
    }, [category]);
    useEffect(() => {
      console.log(`Filter(ward) State has changed : ${ward}`);
    }, [ward]);
  

  return (
    <>
      <Head>
        <title>아주대 의료원-병상가동율2</title>
      </Head>
      <Box component="main" 
      sx={{ flexGrow: 1, py: 0 }}>
        <Container maxWidth="xl">
          <Grid container 
          spacing={4}>
            <Grid xs={12} 
            sm={12} 
            lg={2}>
                         <BasicDatePicker/>
            </Grid>
            <Grid 
            xs={12} 
            sm={12} 
            lg={5}>
               <Checkboxes
              setFilterHandler={setCategory}
              data={categoryFilterData}
              label="Category"
            />
            </Grid>
            <Grid 
            xs={12} 
            sm={12} 
            lg={5}>
               <Checkboxes
              setFilterHandler={setWard}
              data={wardFilterData}
              label="Ward"
            />
            </Grid>
            {/* <Grid 
            xs={12} 
            lg={6}>
              <div className="chartWrapper">
                <TableChartByh data={data} 
                sx={{height:'50%'}} />
                <BarChartByh data={data} 
                sx={{height:'50%'}} />
              </div>
            </Grid> */}
            {/* <Grid 
            xs={12} 
            md={12} 
            lg={6}>
              <WardStatus wardStatusData={wardStatusData}/>
              <OverviewTraffic
                chartSeries={[63, 15, 22]}
                labels={["Desktop", "Tablet", "Phone"]}
                sx={{ height: "100%" }}
              />
            </Grid> */}
          </Grid>
        </Container>
      </Box>
    </>
  );
};
Page.getLayout = (page) => <DashboardLayout>{page}</DashboardLayout>;
export default Page;
